### Target guided ordinal encoding = dataset  ke categorical and target variable ke beech relationship ko categorical se numerical me change karna .

In [1]:
import pandas as pd

In [13]:
# create a dataframe with categorical variable  and a target variable
# ishme target feature price hai

df = pd.DataFrame({'city' : ['satna' , 'rewa' , 'jabalpur' , 'panna' , 'patna','rewa','panna'],
              'price' : [600,200,255,125,189,240,300]})

In [14]:
df

       city  price
0     satna    600
1      rewa    200
2  jabalpur    255
3     panna    125
4     patna    189
5      rewa    240
6     panna    300

In [15]:
# data set me koi outlier na ho to mean ka use karna chahiye nhi to agr outlier  ho to median ka use karna chahiye
# mean nikalne ke liye 

# calculate the mean price for each city 

df.groupby('city')['price'].mean()

city
jabalpur    255.0
panna       212.5
patna       189.0
rewa        220.0
satna       600.0
Name: price, dtype: float64

In [16]:
# replace each city with his mean price 

mean_price = df.groupby ('city')['price'].mean().to_dict()

In [17]:
mean_price

{'jabalpur': 255.0,
 'panna': 212.5,
 'patna': 189.0,
 'rewa': 220.0,
 'satna': 600.0}

In [19]:
df['city_encoded'] = df['city'].map(mean_price)

In [20]:
df['city_encoded']

0    600.0
1    220.0
2    255.0
3    212.5
4    189.0
5    220.0
6    212.5
Name: city_encoded, dtype: float64

In [21]:
# map function se given data ka mean nikal ker ek nya feature bn jata hai 
df

       city  price  city_encoded
0     satna    600         600.0
1      rewa    200         220.0
2  jabalpur    255         255.0
3     panna    125         212.5
4     patna    189         189.0
5      rewa    240         220.0
6     panna    300         212.5

## practice with my self

In [22]:
import seaborn as sns

In [23]:
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [27]:
df.groupby['tota_bill'].mean()

TypeError: 'method' object is not subscriptable